ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
/*
 * com_cpu2.c
 *
 *  Created on: 15 Apr. 2025
 *      Author: lucas
 */

#ifdef CPU2

#include "driverlib.h"
#include "device.h"
#include "registers.h"
#include "led_driver.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

//
// ADS1119 configuration (schematic page 12, U7 and U9)
//
// Both converters sit on I2CB alongside the FM24V10 F-RAM. They are NOT
// memory-addressed devices: every access is a single command byte (Table 7),
// so they must not be driven through the F-RAM i2cReadBlock/i2cWriteBlock
// helpers, which always prepend a 16-bit memory address.
//
#define ADS1119_ADDR_1 0x40  // U7, A1=DGND A0=DGND, thermistors TemP1..TemP4
#define ADS1119_ADDR_2 0x41  // U9, A1=DGND A0=DVDD, thermistors TemP5..TemP8

//
// Command bytes (Table 7). Commands latch on the eighth falling edge of SCL.
//
#define ADS1119_CMD_RESET      0x06U  // 0000 011x
#define ADS1119_CMD_START      0x08U  // 0000 100x - START/SYNC
#define ADS1119_CMD_POWERDOWN  0x02U  // 0000 001x
#define ADS1119_CMD_RDATA      0x10U  // 0001 xxxx
#define ADS1119_CMD_RREG_CFG   0x20U  // 0010 0rxx, r=0 -> configuration (0h)
#define ADS1119_CMD_RREG_STAT  0x24U  // 0010 0rxx, r=1 -> status (1h)
#define ADS1119_CMD_WREG       0x40U  // 0100 00xx + one data byte

//
// Configuration register (Table 8/10) is a single 8-bit register at 0h:
//
//   7:5 MUX   011..110 = AIN0..AIN3 vs AGND (single-ended)
//   4   GAIN  0 = 1
//   3:2 DR    01 = 90 SPS
//   1   CM    1 = continuous
//   0   VREF  1 = external REFP/REFN
//
// The thermistor nets TemP1..TemP4 land on AIN0..AIN3 of U7 individually
// (and TemP5..TemP8 on U9), so all four channels are single-ended against
// AGND - MUX 011 + channel, not the differential 000..010 codes.
//
// VREF is external: REFP carries Vref_2_50_1 / Vref_2_50_2 and REFN goes to
// AGND, so full scale is the 2.50 V reference, not the internal 2.048 V.
//
#define ADS1119_MUX_SHIFT       5U
#define ADS1119_MUX_AIN0_AGND   3U     // 011; +channel selects AIN1..AIN3
#define ADS1119_CFG_GAIN_1      0x00U
//
// Data rate. The part offers 20, 90, 330 and 1000 SPS only - there is no
// slower setting. 20 SPS is the one to use here: cell temperature moves
// slowly, and it is the rate at which the digital filter gives 16-bit
// noise-free resolution with simultaneous 50/60 Hz mains rejection.
//
// It also keeps the DRDY interrupt load down. Each conversion drives a
// blocking I2C read from the ISR, so at 8 channels across two devices
// this is 40 transfers a second rather than 180.
//
#define ADS1119_CFG_DR_20SPS    0x00U  // DR = 00
#define ADS1119_CFG_CM_CONT     0x02U  // CM = 1
#define ADS1119_CFG_VREF_EXT    0x01U  // VREF = 1, external
#define ADS1119_CFG_BASE        (ADS1119_CFG_GAIN_1 | ADS1119_CFG_DR_20SPS |                                  ADS1119_CFG_CM_CONT | ADS1119_CFG_VREF_EXT)

// Configuration byte selecting single-ended AIN<ch> for ch = 0..3.
#define ADS1119_CFG_FOR_CH(ch)  ((uint16_t)ADS1119_CFG_BASE |                                                  (uint16_t)(((ADS1119_MUX_AIN0_AGND + (ch)) &                                              0x07U) << ADS1119_MUX_SHIFT))

//
// External reference in millivolts. The converter is 16-bit bipolar, so a
// full-scale code of +32767 corresponds to +VREF and -32768 to -VREF.
//
#define ADS1119_VREF_MV         2500.0f
#define ADS1119_FULL_SCALE      32768.0f

#define ADS1119_CHANNELS_PER_DEV 4U

#define ADS1119_DRDY_GPIO_1 42     // DRDY for ADS1119 #1 (net DRDY3)
#define ADS1119_DRDY_GPIO_2 43     // DRDY for ADS1119 #2 (net DRDY4)

// EEPROM layout
#define EEPROM_I2C_ADDR       0x50
#define EEPROM_GLOBAL_V_ADDR  0x0100   // 16 bytes = 4 floats

//
// Polling bound for the blocking I2C helpers. At 160 MHz this is a few
// hundred microseconds - long enough for a 400 kHz transfer to complete,
// short enough that a DRDY ISR talking to an absent device does not stall
// the console. (Was 1000000, i.e. milliseconds per failed attempt.)
//
#define BTS_I2C_TIMEOUT_ITERATIONS 20000UL

//
// Idle-loop passes the host bus may sit busy, with no address match,
// before the target is assumed stuck and reset. The loop runs flat out,
// so this is a large number for a short wall-clock time.
//
#define BTS_I2C_TARGET_STUCK_PASSES 200000UL

//
// Address this unit answers to on the host bus.
//
#define BTS_I2C_TARGET_ADDRESS 0x50U

// Validation limits
#define MIN_VOLTAGE 8.0f
#define MAX_VOLTAGE 16.8f

// Default global voltage thresholds, used when the EEPROM copy is invalid
#define DEFAULT_CHARGE_DISABLE_V     9.0f
#define DEFAULT_CHARGE_RESTRICT_V    10.0f
#define DEFAULT_DISCHARGE_RESTRICT_V 15.0f
#define DEFAULT_DISCHARGE_DISABLE_V  16.0f

// Default cell temperature window
#define DEFAULT_MIN_CELL_TEMP        10.0f
#define DEFAULT_MAX_CELL_TEMP        85.0f

//
// Default on-chip ADC scaling for cell voltage and current.
//
// The F2837xD ADC is configured for 12-bit single-ended operation against a
// 3.3 V reference (BTS_HAL_setupADC). BTS_monitor_Iout_Vout normalises the
// raw count to 0..1 and then multiplies by 2.5 before applying these gains,
// so a gain of 1.0 with zero offset yields a 0..2.5 V reading. The cell
// voltage divider and the current-sense amplifier are both unity by default;
// a real gain/offset pair is established by the calibration procedure and
// stored in EEPROM.
//
#define DEFAULT_F28V_GAIN            1.0f
#define DEFAULT_F28V_OFFSET          0.0f
#define DEFAULT_F28I_GAIN            1.0f
#define DEFAULT_F28I_OFFSET          0.0f

//
// Per-channel default Iout/Vout calibration, taken from the PowerSUITE
// generated two-point calibration in bts_user_calibration.h.
//
static const float32_t defaultIoutGain_pu[NUM_CHANNELS] = {
    BTS_IoutGain_ch1_pu, BTS_IoutGain_ch2_pu, BTS_IoutGain_ch3_pu, BTS_IoutGain_ch4_pu,
    BTS_IoutGain_ch5_pu, BTS_IoutGain_ch6_pu, BTS_IoutGain_ch7_pu, BTS_IoutGain_ch8_pu
};
static const float32_t defaultIoutOffset_pu[NUM_CHANNELS] = {
    BTS_IoutOffset_ch1_pu, BTS_IoutOffset_ch2_pu, BTS_IoutOffset_ch3_pu, BTS_IoutOffset_ch4_pu,
    BTS_IoutOffset_ch5_pu, BTS_IoutOffset_ch6_pu, BTS_IoutOffset_ch7_pu, BTS_IoutOffset_ch8_pu
};
