ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
static const float32_t defaultIoutGain_A[NUM_CHANNELS] = {
    BTS_IoutGain_ch1_A, BTS_IoutGain_ch2_A, BTS_IoutGain_ch3_A, BTS_IoutGain_ch4_A,
    BTS_IoutGain_ch5_A, BTS_IoutGain_ch6_A, BTS_IoutGain_ch7_A, BTS_IoutGain_ch8_A
};
static const float32_t defaultIoutOffset_A[NUM_CHANNELS] = {
    BTS_IoutOffset_ch1_A, BTS_IoutOffset_ch2_A, BTS_IoutOffset_ch3_A, BTS_IoutOffset_ch4_A,
    BTS_IoutOffset_ch5_A, BTS_IoutOffset_ch6_A, BTS_IoutOffset_ch7_A, BTS_IoutOffset_ch8_A
};
static const float32_t defaultVoutGain_pu[NUM_CHANNELS] = {
    BTS_VoutGain_ch1_pu, BTS_VoutGain_ch2_pu, BTS_VoutGain_ch3_pu, BTS_VoutGain_ch4_pu,
    BTS_VoutGain_ch5_pu, BTS_VoutGain_ch6_pu, BTS_VoutGain_ch7_pu, BTS_VoutGain_ch8_pu
};
static const float32_t defaultVoutOffset_pu[NUM_CHANNELS] = {
    BTS_VoutOffset_ch1_pu, BTS_VoutOffset_ch2_pu, BTS_VoutOffset_ch3_pu, BTS_VoutOffset_ch4_pu,
    BTS_VoutOffset_ch5_pu, BTS_VoutOffset_ch6_pu, BTS_VoutOffset_ch7_pu, BTS_VoutOffset_ch8_pu
};
static const float32_t defaultVoutGain_V[NUM_CHANNELS] = {
    BTS_VoutGain_ch1_V, BTS_VoutGain_ch2_V, BTS_VoutGain_ch3_V, BTS_VoutGain_ch4_V,
    BTS_VoutGain_ch5_V, BTS_VoutGain_ch6_V, BTS_VoutGain_ch7_V, BTS_VoutGain_ch8_V
};
static const float32_t defaultVoutOffset_V[NUM_CHANNELS] = {
    BTS_VoutOffset_ch1_V, BTS_VoutOffset_ch2_V, BTS_VoutOffset_ch3_V, BTS_VoutOffset_ch4_V,
    BTS_VoutOffset_ch5_V, BTS_VoutOffset_ch6_V, BTS_VoutOffset_ch7_V, BTS_VoutOffset_ch8_V
};

//
// Signal-conditioned thermistor response.
//
// The NTC does not reach the converter directly - it goes through the board
// amplifier stage first, so the useful curve is of the amplifier output, not
// of the raw divider. This fourth-order fit was measured on the hardware and
// covers roughly 20 C to 100 C over 0.1 V to 2.9 V in:
//
//   degC = 0.4038*V^4 - 0.2199*V^3 - 3.2834*V^2 + 28.366*V + 18.323
//
// The curve is well behaved below that: it bottoms out at +18.3 C for 0 V
// in, so a low reading is a cold sensor, never a missing one. There is no
// input this conditioning can produce that maps to an implausible value.
//
// At the other end the converter full scale is the 2.50 V reference, so the
// top of the amplifier range is not reachable - readings saturate near
// 81 C. That is a property of the analogue front end, not of this code.
//
#define BTS_NTC_POLY_C4   ((float)0.4038)
#define BTS_NTC_POLY_C3   ((float)-0.2199)
#define BTS_NTC_POLY_C2   ((float)-3.2834)
#define BTS_NTC_POLY_C1   ((float)28.366)
#define BTS_NTC_POLY_C0   ((float)18.323)

//
// Upper end of the fitted range. The curve bottoms out at +18.3 C for
// 0 V in, so only the top needs bounding.
//
#define BTS_NTC_V_MAX     ((float)2.95)


//
// Measured temperatures live in registers[BTS_CELLTEMP_IDX(ch)] - there is no
// separate local buffer. CPU2 is the only writer of that block.
//
static volatile uint16_t currentAdsChannel[2] = {0, 0}; // Track channel for each ADS1119

//
// Consecutive I2C failures per converter. If an ADS1119 is absent or its
// bus is wedged, every DRDY edge costs a full set of I2C timeouts; left
// unchecked that starves the console and the register interfaces. After
// this many failures the offending DRDY interrupt is masked and its
// temperatures simply stop updating.
//
#define ADS1119_MAX_CONSECUTIVE_FAILURES 8U
static volatile uint16_t adsFailCount[2] = {0, 0};

//
// Forward declarations - every ISR below is registered before it is defined.
//
__interrupt void i2cSlaveISR(void);
__interrupt void i2cSlaveFifoISR(void);
__interrupt void i2cTargetISR(void);
__interrupt void i2cMasterISR(void);
__interrupt void canISR(void);
__interrupt void uartRxISR(void);
__interrupt void timerISR(void);
__interrupt void ads1119Drdy1ISR(void);
__interrupt void ads1119Drdy2ISR(void);

//
// Background tasks, driven from the idle loop in main().
//
void BTS_serviceADS1119(void);
void BTS_serviceDeferredWork(void);

void uartSendResponse(const char* response);
void saveCalibration(uint16_t channel);
void loadCalibration(void);
static void notifyCpu1RegisterWrite(uint16_t regIdx, float32_t value);
static void notifyCpu1CalibrationReload(void);
#if (BTS_CONSOLE_ENABLED == true)
static void formatRegisterValue(char *out, uint16_t outSize,
                                const char *name, float32_t value);
#endif

void initI2C_Slave(void)
{
    //
    // I2CA (GPIO32/33) is the host register command bus; the unit is an I2C
    // target at 0x50. The pins were muxed by CPU1 in BTS_HAL_setupCpu2Pins() -
    // the mux registers are not writable from CPU2.
    //
    // Configured to run from the FIFOs, following TI's own master/slave
    // example. Three details here are easy to get wrong and each one on its
    // own stops the target answering:
    //
    //   The prescaler must be set even though a target never drives SCL. It
    //   divides SYSCLK to the module clock, which the TRM requires to sit
    //   between 7 and 12 MHz because it times the data setup and hold windows
    //   and clocks the input filter.
    //
    //   I2CCNT is decremented by the target as well as the controller. Left
    //   at zero the module acknowledges its address and then holds SCL low
    //   indefinitely while its own status register still reports the bus free.
    //
    //   With the FIFO enabled the basic RRDY and XRDY interrupts must not be
    //   used - the TRM is explicit about this - and the FIFO interrupts arrive
    //   on a different PIE vector, INT_I2CA_FIFO, not INT_I2CA.
    //
    I2C_disableModule(I2CA_BASE);

    I2C_initController(I2CA_BASE, DEVICE_SYSCLK_FREQ, 100000, I2C_DUTYCYCLE_50);
    I2C_setConfig(I2CA_BASE, I2C_TARGET_RECEIVE_MODE);
    I2C_setOwnAddress(I2CA_BASE, BTS_I2C_TARGET_ADDRESS);
    I2C_disableLoopback(I2CA_BASE);
    I2C_setBitCount(I2CA_BASE, I2C_BITCOUNT_8);
    I2C_setDataCount(I2CA_BASE, 2);
    I2C_setAddressMode(I2CA_BASE, I2C_ADDR_MODE_7BITS);

    I2C_enableFIFO(I2CA_BASE);

    //
    // Interrupt on every received byte. The command framing is only two or
    // six bytes long, so there is nothing to gain from batching and a great
    // deal to lose: a partially filled FIFO would stall mid-command.
    //
    I2C_setFIFOInterruptLevel(I2CA_BASE, I2C_FIFO_TXEMPTY, I2C_FIFO_RX1);

    I2C_clearInterruptStatus(I2CA_BASE,
                             I2C_INT_ADDR_TARGET | I2C_INT_ARB_LOST |
                             I2C_INT_NO_ACK | I2C_INT_STOP_CONDITION |
                             I2C_INT_RXFF | I2C_INT_TXFF);

    //
    // Basic sources on 8.1, FIFO sources on 8.2.
    //
    I2C_enableInterrupt(I2CA_BASE,
                        I2C_INT_ADDR_TARGET | I2C_INT_ARB_LOST |
                        I2C_INT_NO_ACK | I2C_INT_STOP_CONDITION |
                        I2C_INT_RXFF | I2C_INT_TXFF);

    I2C_setEmulationMode(I2CA_BASE, I2C_EMULATION_FREE_RUN);

    Interrupt_register(INT_I2CA, &i2cSlaveISR);
    Interrupt_register(INT_I2CA_FIFO, &i2cSlaveFifoISR);
    Interrupt_enable(INT_I2CA);
    Interrupt_enable(INT_I2CA_FIFO);

    I2C_enableModule(I2CA_BASE);
}

void initI2C_Master(void)
{
    //
    // I2CB (GPIO40/41) carries the calibration EEPROM (0x50) and the two
    // ADS1119 temperature ADCs (0x40/0x41), whose DRDY lines are GPIO42/43.
    // Pins muxed by CPU1 in BTS_HAL_setupCpu2Pins().
    //
    I2C_disableModule(I2CB_BASE);
    I2C_initController(I2CB_BASE, DEVICE_SYSCLK_FREQ, 400000, I2C_DUTYCYCLE_50);
    I2C_setConfig(I2CB_BASE, I2C_CONTROLLER_SEND_MODE);
    I2C_setBitCount(I2CB_BASE, I2C_BITCOUNT_8);
    I2C_setEmulationMode(I2CB_BASE, I2C_EMULATION_FREE_RUN);
    I2C_enableModule(I2CB_BASE);
}

//
// Blocking byte-level EEPROM/I2C helpers. These run only at boot and on an
// explicit calibration save, so a polled implementation is appropriate.
//
static bool i2cMasterWaitBusFree(void)
{
    //
    // Bounded: these helpers are also reached from the ADS1119 DRDY ISRs, so
    // an absent or wedged device on the bus must not stall the CPU forever.
    //
    uint32_t guard = 0;
    while (I2C_isBusBusy(I2CB_BASE)) {
        if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
            //
            // BB latches until a stop is actually seen on the wire. A
            // transfer that ended without one - a read whose stop was
            // requested but never completed, or a device that stretched
            // the clock through it - leaves the module permanently busy,
            // and from then on every setTargetAddress() write is ignored
            // and no new START is ever emitted. Without this the first
            // wedged transfer would silently disable the bus for good.
            //
            // Resetting through nIRS is the documented way out: it clears
            // BB and returns the module to its idle state. The clocking
            // configuration survives, so only the enable has to be
            // re-asserted.
            //
            I2C_disableModule(I2CB_BASE);
            SysCtl_delay(100U);
            I2C_enableModule(I2CB_BASE);
            I2C_clearStatus(I2CB_BASE,
                            I2C_STS_NO_ACK | I2C_STS_ARB_LOST |
                            I2C_STS_REG_ACCESS_RDY | I2C_STS_STOP_CONDITION);
            return !I2C_isBusBusy(I2CB_BASE);
        }
    }
    return true;
}

//
// Waits for a requested stop condition to actually appear on the bus.
//
// Bounded like every other wait here: if the stop never lands the
// module is left busy and the next caller's bus-free wait performs the
// reset, rather than this spinning forever inside an ISR.
//
static void i2cMasterWaitStopComplete(void)
{
    uint32_t guard = 0;
    while (I2C_isBusBusy(I2CB_BASE)) {
        if (++guard > BTS_I2C_TIMEOUT_ITERATIONS) {
            return;
        }
    }
}

