ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
static void calibrationToBytes(const BTS_channelCalibration *cal, uint16_t *bytes)
{
    const uint16_t *words = (const uint16_t *)cal;
    uint16_t i;
    for (i = 0; i < (uint16_t)sizeof(BTS_channelCalibration); i++) {
        bytes[i * 2U]      = words[i] & 0xFFU;
        bytes[i * 2U + 1U] = (words[i] >> 8) & 0xFFU;
    }
}

static void bytesToCalibration(const uint16_t *bytes, BTS_channelCalibration *cal)
{
    uint16_t *words = (uint16_t *)cal;
    uint16_t i;
    for (i = 0; i < (uint16_t)sizeof(BTS_channelCalibration); i++) {
        words[i] = (bytes[i * 2U] & 0xFFU) | ((bytes[i * 2U + 1U] & 0xFFU) << 8);
    }
}

bool writeEEPROM(uint16_t channel, const BTS_channelCalibration* data)
{
    uint16_t bytes[CAL_EEPROM_BYTES];
    uint16_t eepromAddr = channel * CAL_EEPROM_BYTES;

    calibrationToBytes(data, bytes);
    return i2cWriteBlock(EEPROM_I2C_ADDR, eepromAddr, bytes, CAL_EEPROM_BYTES);
}

bool readEEPROM(uint16_t channel, BTS_channelCalibration* data)
{
    uint16_t bytes[CAL_EEPROM_BYTES];
    uint16_t eepromAddr = channel * CAL_EEPROM_BYTES;

    if (!i2cReadBlock(EEPROM_I2C_ADDR, eepromAddr, bytes, CAL_EEPROM_BYTES)) {
        return false;
    }
    bytesToCalibration(bytes, data);
    return true;
}

//
// A calibration block is valid when the header matches and the channel it
// carries is the one we asked for. The channel lives in the low half of the
// header word rather than being OR-ed into the magic value, which would
// alias for channels >= 4.
//
static bool validateCalibration(const BTS_channelCalibration* cal, uint16_t channel)
{
    if ((cal->header & BTS_CAL_HEADER_MASK) != BTS_CAL_HEADER) {
        return false;
    }
    if ((cal->header & BTS_CAL_CHANNEL_MASK) != (uint32_t)channel) {
        return false;
    }
    if (cal->MinCellTemp < -40.0f || cal->MaxCellTemp > 100.0f || cal->MinCellTemp >= cal->MaxCellTemp) {
        return false;
    }
    if (cal->F28V_Gain < 0.5f || cal->F28V_Gain > 2.0f || cal->F28V_Offset < -1.0f || cal->F28V_Offset > 1.0f) {
        return false;
    }
    if (cal->F28I_Gain < 0.5f || cal->F28I_Gain > 2.0f || cal->F28I_Offset < -2.0f || cal->F28I_Offset > 2.0f) {
        return false;
    }
    return true;
}

static bool validateGlobalVoltages(void)
{
    float chargeDisableV = registers[BTS_REG_IDX(eChargeDisableV)];
    float chargeRestrictV = registers[BTS_REG_IDX(eChargeRestrictV)];
    float dischargeRestrictV = registers[BTS_REG_IDX(eDischargeRestrictV)];
    float dischargeDisableV = registers[BTS_REG_IDX(eDischargeDisableV)];

    return (chargeDisableV >= MIN_VOLTAGE &&
            chargeDisableV <= chargeRestrictV &&
            chargeRestrictV <= dischargeRestrictV &&
            dischargeRestrictV <= dischargeDisableV &&
            dischargeDisableV <= MAX_VOLTAGE);
}

//
//=============================================================================
// CPU2 -> CPU1 notification
//=============================================================================
//
// registers[] lives in CPU2TOCPU1RAM and is written here before the flag is
// raised, so CPU1 sees a settled value. These are non-blocking: if the
// previous flag has not been acknowledged yet the notification is skipped,
// because CPU1 re-reads the affected block from registers[] anyway.
//
static void notifyCpu1RegisterWrite(uint16_t regIdx, float32_t value)
{
    if (IPC_isFlagBusyLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_REG_WRITE)) {
        return;
    }
    ipcMsg.regAddr = regIdx;
    ipcMsg.value = value;
    IPC_setFlagLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_REG_WRITE);
}

//
// Signals that every channel's calibration has been rewritten. CPU1 responds
// by reloading all channels and recalculating its program variables.
//
static void notifyCpu1CalibrationReload(void)
{
    IPC_setFlagLtoR(IPC_CPU2_L_CPU1_R, BTS_IPC_FLAG_CAL_RELOAD);
}

//
// Installs the compiled-in defaults for one channel.
//
static void applyDefaultCalibration(uint16_t ch)
{
    uint16_t tempBase = BTS_TEMP_BASE(ch);
    uint16_t calBase  = BTS_CAL_BASE(ch);

    registers[tempBase + BTS_TEMP_MIN] = DEFAULT_MIN_CELL_TEMP;
    registers[tempBase + BTS_TEMP_MAX] = DEFAULT_MAX_CELL_TEMP;

    registers[calBase + BTS_CAL_F28V_GAIN]      = DEFAULT_F28V_GAIN;
    registers[calBase + BTS_CAL_F28V_OFFSET]    = DEFAULT_F28V_OFFSET;
    registers[calBase + BTS_CAL_F28I_GAIN]      = DEFAULT_F28I_GAIN;
    registers[calBase + BTS_CAL_F28I_OFFSET]    = DEFAULT_F28I_OFFSET;
    registers[calBase + BTS_CAL_IOUT_GAIN_PU]   = defaultIoutGain_pu[ch];
    registers[calBase + BTS_CAL_IOUT_OFFSET_PU] = defaultIoutOffset_pu[ch];
    registers[calBase + BTS_CAL_IOUT_GAIN_A]    = defaultIoutGain_A[ch];
    registers[calBase + BTS_CAL_IOUT_OFFSET_A]  = defaultIoutOffset_A[ch];
    registers[calBase + BTS_CAL_VOUT_GAIN_PU]   = defaultVoutGain_pu[ch];
    registers[calBase + BTS_CAL_VOUT_OFFSET_PU] = defaultVoutOffset_pu[ch];
    registers[calBase + BTS_CAL_VOUT_GAIN_V]    = defaultVoutGain_V[ch];
    registers[calBase + BTS_CAL_VOUT_OFFSET_V]  = defaultVoutOffset_V[ch];
}

//
// Copies a validated EEPROM block into the register file.
//
static void applyStoredCalibration(uint16_t ch, const BTS_channelCalibration *cal)
{
    uint16_t tempBase = BTS_TEMP_BASE(ch);
    uint16_t calBase  = BTS_CAL_BASE(ch);

    registers[tempBase + BTS_TEMP_MIN] = cal->MinCellTemp;
    registers[tempBase + BTS_TEMP_MAX] = cal->MaxCellTemp;

    registers[calBase + BTS_CAL_F28V_GAIN]      = cal->F28V_Gain;
    registers[calBase + BTS_CAL_F28V_OFFSET]    = cal->F28V_Offset;
    registers[calBase + BTS_CAL_F28I_GAIN]      = cal->F28I_Gain;
    registers[calBase + BTS_CAL_F28I_OFFSET]    = cal->F28I_Offset;
    registers[calBase + BTS_CAL_IOUT_GAIN_PU]   = cal->IoutGain_pu;
    registers[calBase + BTS_CAL_IOUT_OFFSET_PU] = cal->IoutOffset_pu;
    registers[calBase + BTS_CAL_IOUT_GAIN_A]    = cal->IoutGain_A;
    registers[calBase + BTS_CAL_IOUT_OFFSET_A]  = cal->IoutOffset_A;
    registers[calBase + BTS_CAL_VOUT_GAIN_PU]   = cal->VoutGain_pu;
    registers[calBase + BTS_CAL_VOUT_OFFSET_PU] = cal->VoutOffset_pu;
    registers[calBase + BTS_CAL_VOUT_GAIN_V]    = cal->VoutGain_V;
    registers[calBase + BTS_CAL_VOUT_OFFSET_V]  = cal->VoutOffset_V;
}

//
// Boot-time calibration load.
//
// For each channel: read the EEPROM block, and if it validates, load it into
// the register file; otherwise install safe defaults. The global voltage
// thresholds get the same treatment. Once the whole register file is
// populated, CPU1 is notified once so it can recalculate every channel's
// program variables and start running - rather than being interrupted eight
// times mid-population with a partially-valid register file.
//
void loadCalibration(void)
{
    uint16_t ch;
    uint16_t voltageBytes[16];

    for (ch = 0; ch < NUM_CHANNELS; ch++) {
        BTS_channelCalibration cal;

