ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
        if (readEEPROM(ch, &cal) && validateCalibration(&cal, ch)) {
            calibrationData[ch] = cal;
            applyStoredCalibration(ch, &cal);
        } else {
            applyDefaultCalibration(ch);
        }
    }

    //
    // Global charge/discharge voltage thresholds.
    //
    if (i2cReadBlock(EEPROM_I2C_ADDR, EEPROM_GLOBAL_V_ADDR, voltageBytes, 16U)) {
        float32_t voltages[4];
        uint16_t *dst = (uint16_t *)voltages;
        uint16_t i;
        for (i = 0; i < 8U; i++) {
            dst[i] = (voltageBytes[i * 2U] & 0xFFU) |
                     ((voltageBytes[i * 2U + 1U] & 0xFFU) << 8);
        }

        registers[BTS_REG_IDX(eChargeDisableV)]     = voltages[0];
        registers[BTS_REG_IDX(eChargeRestrictV)]    = voltages[1];
        registers[BTS_REG_IDX(eDischargeRestrictV)] = voltages[2];
        registers[BTS_REG_IDX(eDischargeDisableV)]  = voltages[3];
    }

    if (!validateGlobalVoltages()) {
        registers[BTS_REG_IDX(eChargeDisableV)]     = DEFAULT_CHARGE_DISABLE_V;
        registers[BTS_REG_IDX(eChargeRestrictV)]    = DEFAULT_CHARGE_RESTRICT_V;
        registers[BTS_REG_IDX(eDischargeRestrictV)] = DEFAULT_DISCHARGE_RESTRICT_V;
        registers[BTS_REG_IDX(eDischargeDisableV)]  = DEFAULT_DISCHARGE_DISABLE_V;
    }

    //
    // The register file is now complete and consistent - tell CPU1 to
    // recalculate its program variables from it and go.
    //
    notifyCpu1CalibrationReload();
}

void saveCalibration(uint16_t channel)
{
    BTS_channelCalibration cal;
    uint16_t tempBase = BTS_TEMP_BASE(channel);
    uint16_t calBase  = BTS_CAL_BASE(channel);

    cal.header   = BTS_CAL_MAKE_HEADER(channel);
    cal.dateTime = CPUTimer_getTimerCount(CPUTIMER1_BASE);

    cal.MinCellTemp   = registers[tempBase + BTS_TEMP_MIN];
    cal.MaxCellTemp   = registers[tempBase + BTS_TEMP_MAX];
    cal.F28V_Gain     = registers[calBase + BTS_CAL_F28V_GAIN];
    cal.F28V_Offset   = registers[calBase + BTS_CAL_F28V_OFFSET];
    cal.F28I_Gain     = registers[calBase + BTS_CAL_F28I_GAIN];
    cal.F28I_Offset   = registers[calBase + BTS_CAL_F28I_OFFSET];
    cal.IoutGain_pu   = registers[calBase + BTS_CAL_IOUT_GAIN_PU];
    cal.IoutOffset_pu = registers[calBase + BTS_CAL_IOUT_OFFSET_PU];
    cal.IoutGain_A    = registers[calBase + BTS_CAL_IOUT_GAIN_A];
    cal.IoutOffset_A  = registers[calBase + BTS_CAL_IOUT_OFFSET_A];
    cal.VoutGain_pu   = registers[calBase + BTS_CAL_VOUT_GAIN_PU];
    cal.VoutOffset_pu = registers[calBase + BTS_CAL_VOUT_OFFSET_PU];
    cal.VoutGain_V    = registers[calBase + BTS_CAL_VOUT_GAIN_V];
    cal.VoutOffset_V  = registers[calBase + BTS_CAL_VOUT_OFFSET_V];

    if (validateCalibration(&cal, channel)) {
        if (writeEEPROM(channel, &cal)) {
            calibrationData[channel] = cal;
        }
    }

    //
    // Channel 0 also carries the unit-wide voltage thresholds.
    //
    if (channel == 0 && validateGlobalVoltages()) {
        float32_t voltages[4];
        uint16_t voltageBytes[16];
        const uint16_t *src = (const uint16_t *)voltages;
        uint16_t i;

        voltages[0] = registers[BTS_REG_IDX(eChargeDisableV)];
        voltages[1] = registers[BTS_REG_IDX(eChargeRestrictV)];
        voltages[2] = registers[BTS_REG_IDX(eDischargeRestrictV)];
        voltages[3] = registers[BTS_REG_IDX(eDischargeDisableV)];

        for (i = 0; i < 8U; i++) {
            voltageBytes[i * 2U]      = src[i] & 0xFFU;
            voltageBytes[i * 2U + 1U] = (src[i] >> 8) & 0xFFU;
        }
        i2cWriteBlock(EEPROM_I2C_ADDR, EEPROM_GLOBAL_V_ADDR, voltageBytes, 16U);
    }
}

//
// Commits every channel to EEPROM. Triggered by a host writing
// eCalibrationMode = 2.
//
static void saveAllCalibration(void)
{
    uint16_t ch;
    for (ch = 0; ch < NUM_CHANNELS; ch++) {
        saveCalibration(ch);
    }
}

void initCAN(void)
{
    //
    // CANA pins (GPIO30 = RX, GPIO31 = TX) muxed by CPU1.
    //
    CAN_initModule(CANA_BASE);
    CAN_setBitRate(CANA_BASE, DEVICE_SYSCLK_FREQ, CAN_BITRATE, 16);
    CAN_enableInterrupt(CANA_BASE, CAN_INT_IE0 | CAN_INT_ERROR | CAN_INT_STATUS);
    Interrupt_register(INT_CANA0, &canISR);
    Interrupt_enable(INT_CANA0);

    for (uint16_t i = 0; i < NUM_CHANNELS; i++) {
        CAN_setupMessageObject(CANA_BASE, i + 1, CAN_MSG_ID_BASE | ((uint32_t)i << 20) | 0x01,
                               CAN_MSG_FRAME_EXT, CAN_MSG_OBJ_TYPE_TX, 0,
                               CAN_MSG_OBJ_NO_FLAGS, 8);
    }
    CAN_setupMessageObject(CANA_BASE, 9, CAN_MSG_ID_BASE | 0x02, CAN_MSG_FRAME_EXT,
                           CAN_MSG_OBJ_TYPE_RX, 0x1FFFFFFF,
                           CAN_MSG_OBJ_RX_INT_ENABLE, 8);

    CAN_startModule(CANA_BASE);
}

void sendCANData(uint16_t channel)
{
    uint16_t data[8];
    const uint16_t *v;
    const uint16_t *c;

    if (channel >= NUM_CHANNELS) return;

    v = (const uint16_t *)&canData[channel].voltage;
    c = (const uint16_t *)&canData[channel].current;

    data[0] = canData[channel].channel & 0xFFU;
    data[1] = 0;
    data[2] = v[0] & 0xFFU;
    data[3] = (v[0] >> 8) & 0xFFU;
    data[4] = v[1] & 0xFFU;
    data[5] = (v[1] >> 8) & 0xFFU;
    data[6] = c[0] & 0xFFU;
    data[7] = (c[0] >> 8) & 0xFFU;

    CAN_sendMessage(CANA_BASE, channel + 1, 8, data);
}

volatile uint16_t sfraEnabled = 0;

void initUART(void)
{
#if (BTS_CONSOLE_ENABLED == true)
    //
    // Present only in a debug build (BTS_DEBUG_CONSOLE): the AT console
    // runs on SCIA (GPIO28/29), reaching the controlCARD's isolated FTDI
    // backchannel over the same USB cable as the debug probe.
    //
    //
    // Console pins (GPIO28/29) muxed by CPU1.
    //
    SCI_setConfig(BTS_CONSOLE_SCI_BASE, DEVICE_LSPCLK_FREQ, BTS_CONSOLE_BAUDRATE,
                  (SCI_CONFIG_WLEN_8 | SCI_CONFIG_STOP_ONE | SCI_CONFIG_PAR_NONE));
    SCI_resetChannels(BTS_CONSOLE_SCI_BASE);
    SCI_enableFIFO(BTS_CONSOLE_SCI_BASE);
    SCI_enableModule(BTS_CONSOLE_SCI_BASE);
    SCI_performSoftwareReset(BTS_CONSOLE_SCI_BASE);

    //
    // With the FIFO enabled the receiver raises RXFFINT, not RXRDY - enabling
    // SCI_INT_RXRDY_BRKDT here sets RXBKINTENA, which never fires in FIFO
    // mode, so characters pile up until the FIFO overflows and no ISR runs.
    // Interrupt after every character so AT commands are processed promptly.
    //
    SCI_setFIFOInterruptLevel(BTS_CONSOLE_SCI_BASE, SCI_FIFO_TX16, SCI_FIFO_RX1);
    SCI_enableInterrupt(BTS_CONSOLE_SCI_BASE, SCI_INT_RXFF);
    SCI_clearInterruptStatus(BTS_CONSOLE_SCI_BASE, SCI_INT_RXFF);

