ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
    while (I2C_isBusBusy(I2CB_BASE)) {
        if (++guard > ADS1119_PHASE_MAX_POLLS) {
            I2C_disableModule(I2CB_BASE);
            SysCtl_delay(100U);
            I2C_enableModule(I2CB_BASE);
            break;
        }
    }

    I2C_clearStatus(I2CB_BASE,
                    I2C_STS_NO_ACK | I2C_STS_ARB_LOST |
                    I2C_STS_REG_ACCESS_RDY | I2C_STS_STOP_CONDITION);

    adsState[unit]   = eAdsIdle;
    adsRxCount[unit] = 0U;
    adsGuard[unit]   = 0U;

    if (adsFailCount[unit] < ADS1119_MAX_CONSECUTIVE_FAILURES) {
        adsFailCount[unit]++;
        if (adsFailCount[unit] >= ADS1119_MAX_CONSECUTIVE_FAILURES) {
            //
            // Persistently unreachable: stop taking its interrupts so a dead
            // converter cannot keep occupying the bus.
            //
            GPIO_disableInterrupt((unit == 0U) ? GPIO_INT_XINT1
                                               : GPIO_INT_XINT2);
        }
    }
}

//
// Advances one converter by a single step. Returns immediately whenever the
// hardware is not ready yet, so no call blocks.
//
static void ads1119Service(uint16_t unit)
{
    uint16_t devAddr = (unit == 0U) ? ADS1119_ADDR_1 : ADS1119_ADDR_2;
    uint16_t status  = I2C_getStatus(I2CB_BASE);

    switch (adsState[unit]) {

    case eAdsIdle:
        //
        // Only start once DRDY has fired and the bus is genuinely free - the
        // other converter, the F-RAM, or a calibration save may be using it.
        //
        if ((adsPending[unit] == 0U) || I2C_isBusBusy(I2CB_BASE)) {
            return;
        }

        adsPending[unit] = 0U;
        adsRxCount[unit] = 0U;
        adsGuard[unit]   = 0U;

        //
        // Phase 1 of RDATA: the command byte, no stop, repeated start to
        // follow. Committed as a single write to I2CMDR for the reason given
        // in ads1119Write().
        //
        I2C_setTargetAddress(I2CB_BASE, devAddr);
        HWREGH(I2CB_BASE + I2C_O_CNT) = 1U;
        I2C_putData(I2CB_BASE, ADS1119_CMD_RDATA);
        HWREGH(I2CB_BASE + I2C_O_MDR) = I2C_MDR_FREE | I2C_MDR_STT |
                                        I2C_MDR_MST  | I2C_MDR_TRX |
                                        I2C_MDR_IRS;
        adsState[unit] = eAdsReadCmd;
        return;

    case eAdsReadCmd:
        if (status & I2C_STS_NO_ACK) {
            I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
            ads1119Abort(unit);
            return;
        }
        if ((status & I2C_STS_REG_ACCESS_RDY) == 0U) {
            if (++adsGuard[unit] > ADS1119_PHASE_MAX_POLLS) {
                ads1119Abort(unit);
            }
            return;
        }

        //
        // Phase 2: repeated start into a read, with the stop pre-armed so the
        // module releases the bus itself after the second byte.
        //
        adsGuard[unit] = 0U;
        HWREGH(I2CB_BASE + I2C_O_CNT) = 2U;
        HWREGH(I2CB_BASE + I2C_O_MDR) = I2C_MDR_FREE | I2C_MDR_STT |
                                        I2C_MDR_STP  | I2C_MDR_MST |
                                        I2C_MDR_IRS;
        adsState[unit] = eAdsReadData;
        return;

    case eAdsReadData:
        if (status & I2C_STS_NO_ACK) {
            I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
            ads1119Abort(unit);
            return;
        }
        if ((status & I2C_STS_RX_DATA_RDY) == 0U) {
            if (++adsGuard[unit] > ADS1119_PHASE_MAX_POLLS) {
                ads1119Abort(unit);
            }
            return;
        }

        adsGuard[unit] = 0U;
        adsRxBytes[unit][adsRxCount[unit]] = I2C_getData(I2CB_BASE) & 0xFFU;
        adsRxCount[unit]++;

        if (adsRxCount[unit] < 2U) {
            return;             // second byte still to come
        }

        //
        // Both bytes in. Convert and publish, then point the mux at the next
        // thermistor - the configuration write restarts conversion by itself.
        //
        {
            uint16_t channel = adsSampleCh[unit];
            int16_t  raw = (int16_t)(((adsRxBytes[unit][0] & 0xFFU) << 8) |
                                      (adsRxBytes[unit][1] & 0xFFU));
            float    mV  = ((float)raw * ADS1119_VREF_MV) / ADS1119_FULL_SCALE;

            adsFailCount[unit] = 0U;

            //
            // The first result after a mux change belongs to the old
            // input: the conversion was already in flight when the
            // configuration was written, and at 20 SPS that is a whole
            // 50 ms of stale charge on the new channel. Publishing it
            // smears one thermistor onto its neighbour - a hot sensor
            // shows up on the channel next to it, then vanishes.
            //
            //
            // No discard is needed here. The channel is latched when the
            // read starts, and the dwell after each mux change already
            // drops any conversion left over from the previous input, so
            // whatever arrives now genuinely belongs to this channel.
            //
            publishCellTemp(channel + (unit * ADS1119_CHANNELS_PER_DEV),
                            mVToTemperature(mV), true);
        }

        //
        // A real sample was published for this channel, so move on.
        //
        // currentAdsChannel now names the input the mux is about to be
        // pointed at, and adsSampleCh keeps naming the one currently
        // selected - which is what the next conversion will return.
        //
        currentAdsChannel[unit] =
            (currentAdsChannel[unit] + 1U) % ADS1119_CHANNELS_PER_DEV;
        adsState[unit] = eAdsSetMux;
        return;

    case eAdsSetMux:
        //
        // The read armed its own stop, so wait for the bus to clear before
        // starting the configuration frame.
        //
        if (I2C_isBusBusy(I2CB_BASE)) {
            if (++adsGuard[unit] > ADS1119_PHASE_MAX_POLLS) {
                ads1119Abort(unit);
            }
            return;
        }

        adsGuard[unit] = 0U;

        //
        // WREG is command byte plus data byte, and both have to go out inside
        // one frame without a gap.
        //
        // The part resets its own I2C interface if a host starts a command
        // and then stalls for 14000 tMOD - about 55 ms at the 256 kHz
        // modulator. It also NACKs the trailing byte when that happens. So
        // the two bytes are pushed back to back here, with only the short
        // wait for I2CDXR to drain in between, rather than being split
        // across service calls where an interrupt could open a gap.
        //
        // The wait is for one byte at 400 kHz, roughly 22 us. That is long
        // by ISR standards but trivial next to the 50 ms budget, and it is
        // the only way to keep the frame contiguous without a transmit FIFO.
        //
        {
            uint16_t cfg = ADS1119_CFG_FOR_CH(currentAdsChannel[unit]);
            uint32_t guard = 0;

            I2C_setTargetAddress(I2CB_BASE, devAddr);
            HWREGH(I2CB_BASE + I2C_O_CNT) = 2U;
            I2C_putData(I2CB_BASE, ADS1119_CMD_WREG);
            HWREGH(I2CB_BASE + I2C_O_MDR) = I2C_MDR_FREE | I2C_MDR_STT |
                                            I2C_MDR_STP  | I2C_MDR_MST |
                                            I2C_MDR_TRX  | I2C_MDR_IRS;

            while ((I2C_getStatus(I2CB_BASE) & I2C_STS_TX_DATA_RDY) == 0U) {
                if (++guard > ADS1119_WREG_BYTE_TIMEOUT) {
                    ads1119Abort(unit);
                    return;
                }
                if (I2C_getStatus(I2CB_BASE) & I2C_STS_NO_ACK) {
                    I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
                    ads1119Abort(unit);
                    return;
                }
            }

            I2C_putData(I2CB_BASE, cfg & 0xFFU);
        }

        //
        // Let the WREG frame finish before anything else touches the bus.
        //
        // The stop was armed with the frame, so the module emits it once
        // the byte count reaches zero. Moving straight on would start the
        // next frame on top of this one: the START/SYNC that follows
        // truncates the configuration write, the MUX field never takes
        // effect, and every channel keeps sampling AIN0 while the code
        // believes it is cycling.
        //
        adsState[unit] = eAdsMuxDone;
        return;

    case eAdsMuxDone:
        if (I2C_isBusBusy(I2CB_BASE)) {
            if (++adsGuard[unit] > ADS1119_PHASE_MAX_POLLS) {
                ads1119Abort(unit);
            }
            return;
        }

        if (status & I2C_STS_NO_ACK) {
            I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
            ads1119Abort(unit);
            return;
        }

        adsGuard[unit] = 0U;

