ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
        adsState[unit] = eAdsStart;
        return;

    case eAdsStart:
        //
        // Re-arm conversions after the mux change.
        //
        // Writing the configuration register restarts an ongoing
        // conversion by itself, so in steady state this is redundant.
        // It matters on the edges: if the part has fallen back to its
        // reset defaults - single-shot mode - nothing else would ever
        // start it converting again, and the channel would read zero
        // forever with no error anywhere to show why.
        //
        if (I2C_isBusBusy(I2CB_BASE)) {
            if (++adsGuard[unit] > ADS1119_PHASE_MAX_POLLS) {
                ads1119Abort(unit);
            }
            return;
        }

        adsGuard[unit] = 0U;

        I2C_setTargetAddress(I2CB_BASE, devAddr);
        HWREGH(I2CB_BASE + I2C_O_CNT) = 1U;
        I2C_putData(I2CB_BASE, ADS1119_CMD_START);
        HWREGH(I2CB_BASE + I2C_O_MDR) = I2C_MDR_FREE | I2C_MDR_STT |
                                        I2C_MDR_STP  | I2C_MDR_MST |
                                        I2C_MDR_TRX  | I2C_MDR_IRS;

        //
        // Like the WREG above, this frame has to be allowed to finish.
        // The dwell that follows is counted in service calls, not bus
        // time, so without waiting here the next read would start on top
        // of this one.
        //
        adsState[unit] = eAdsStartDone;
        return;

    case eAdsStartDone:
        if (I2C_isBusBusy(I2CB_BASE)) {
            if (++adsGuard[unit] > ADS1119_PHASE_MAX_POLLS) {
                ads1119Abort(unit);
            }
            return;
        }

        if (status & I2C_STS_NO_ACK) {
            I2C_clearStatus(I2CB_BASE, I2C_STS_NO_ACK);
            ads1119Abort(unit);
            return;
        }

        adsGuard[unit] = 0U;

        //
        // Hold this channel for a while before moving on. The conversion
        // itself settles in one 20 SPS period, but the analogue front end
        // is slower than the converter and cell temperature does not move
        // quickly - dwelling here gives the reading time to be real rather
        // than a smear of the previous channel.
        //
        adsDwellStart[unit] = CPUTimer_getTimerCount(CPUTIMER0_BASE);
        adsState[unit]  = eAdsSettle;
        return;

    case eAdsSettle:
        //
        // Wait out the dwell, then require a completely fresh conversion.
        //
        // The dwell alone is not enough: DRDY keeps asserting throughout it,
        // so whatever is pending the moment it expires may still be the
        // conversion that was already in flight when the mux moved. Clearing
        // the pending flag at the end and waiting for the next edge
        // guarantees the sample that gets published started after the new
        // channel was selected.
        //
        // START/SYNC restarted the converter, so the first result arrives one
        // conversion period later - 50 ms at 20 SPS.
        //
        {
            //
            // CPU timer 0 counts down, so elapsed time is start - now,
            // and the subtraction wraps correctly on reload.
            //
            uint32_t now     = CPUTimer_getTimerCount(CPUTIMER0_BASE);
            uint32_t elapsed = adsDwellStart[unit] - now;

            if (elapsed < ADS1119_SETTLE_COUNTS) {
                adsPending[unit] = 0U;  // ignore results from the old input
                return;
            }
        }

        //
        // Settled. The mux now points at currentAdsChannel, so that is
        // the input the next conversion measures - record it as the
        // channel this result will be credited to.
        //
        adsSampleCh[unit] = currentAdsChannel[unit];
        adsState[unit]    = eAdsIdle;
        return;

    default:
        adsState[unit] = eAdsIdle;
        return;
    }
}

//
// Drives both converters. Called from the idle loop; performs at most one
// step per converter per call and never waits on the bus.
//
void BTS_serviceADS1119(void)
{
    ads1119Service(0U);
    ads1119Service(1U);
}

//
// Mirrors the measurements and status CPU1 published in CPU1TOCPU2RAM into
// the register file, so the external interfaces see current data. The seq
// counter is even and unchanged across a consistent snapshot.
//
static void mirrorCpu1Status(void)
{
    uint32_t seqBefore;
    uint32_t statusBits[NUM_CHANNELS];
    float32_t cellV[NUM_CHANNELS];
    float32_t cellI[NUM_CHANNELS];
    float32_t inputV;
    uint32_t unitState;
    uint32_t tripStatus;
    uint32_t strapsValid;
    uint32_t slotMode;
    uint32_t slotEnable;
    uint32_t groupSize;
    uint16_t ch;
    uint16_t attempts = 0;

    do {
        seqBefore = cpu1Status.seq;
        if (seqBefore & 1U) {
            continue;   // CPU1 is mid-update
        }
        for (ch = 0; ch < NUM_CHANNELS; ch++) {
            statusBits[ch] = cpu1Status.statusBits[ch];
            cellV[ch] = cpu1Status.cellVoltage[ch];
            cellI[ch] = cpu1Status.cellCurrent[ch];
        }
        inputV     = cpu1Status.inputVoltage;
        unitState  = cpu1Status.unitState;
        tripStatus = cpu1Status.tripStatus;
        strapsValid = cpu1Status.strapsValid;
        slotMode    = cpu1Status.slotMode;
        slotEnable  = cpu1Status.slotEnable;
        groupSize   = cpu1Status.groupSize;
    } while (cpu1Status.seq != seqBefore && ++attempts < 4U);

    if (attempts >= 4U) {
        return;   // could not get a clean snapshot; try again next tick
    }

    for (ch = 0; ch < NUM_CHANNELS; ch++) {
        registers[BTS_CTRL_BASE(ch) + BTS_REG_IDX(eCh0_Status)] = (float32_t)statusBits[ch];
        registers[BTS_STATS_BASE(ch) + (BTS_REG_IDX(eCh0_CellVoltage) - BTS_REG_IDX(eCh0_CurrentAcc))] = cellV[ch];
        registers[BTS_STATS_BASE(ch) + (BTS_REG_IDX(eCh0_CellCurrent) - BTS_REG_IDX(eCh0_CurrentAcc))] = cellI[ch];
    }

    registers[BTS_REG_IDX(eInputVoltage)] = inputV;
    registers[BTS_REG_IDX(eUnitState)]    = (float32_t)unitState;
    registers[BTS_REG_IDX(eTripStatus)]   = (float32_t)tripStatus;

    //
    // Dip-switch straps. Only published once CPU1 says it has latched
    // them - the two cores boot independently, and this message RAM is
    // NOLOAD from CPU2's side, so before that the values are whatever the
    // RAM powered up holding.
    //
    if (strapsValid != 0U) {
        registers[BTS_REG_IDX(eSlotMode)]   = (float32_t)slotMode;
        registers[BTS_REG_IDX(eSlotEnable)] = (float32_t)slotEnable;
        registers[BTS_REG_IDX(eGroupSize)]  = (float32_t)groupSize;
    }
}

static volatile uint16_t canTxChannel = 0;

