ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
void BTS_serviceDeferredWork(void)
{
    serviceI2CTargetWatchdog();

    if (calibrationSavePending == 0U) {
        return;
    }

    //
    // Cleared first so a request arriving during the save queues another
    // pass rather than being lost.
    //
    calibrationSavePending = 0U;
    saveAllCalibration();
}

//
// The register protocol carries each float MSB-first on the wire. A C28x
// "byte" is 16 bits, so a float is two 16-bit words rather than four bytes -
// indexing it as a byte array (as older revisions did) runs off the end of
// the object. These helpers pack and unpack explicitly:
//
//   wire byte 0 -> bits 31..24   word[1] high half
//   wire byte 1 -> bits 23..16   word[1] low half
//   wire byte 2 -> bits 15..8    word[0] high half
//   wire byte 3 -> bits  7..0    word[0] low half
//
static inline void floatPutWireByte(volatile float32_t *f, uint16_t index, uint16_t value)
{
    volatile uint16_t *w = (volatile uint16_t *)f;
    uint16_t word = 1U - (index >> 1);       // bytes 0,1 -> word 1; 2,3 -> word 0
    if ((index & 1U) == 0U) {
        w[word] = (w[word] & 0x00FFU) | ((value & 0xFFU) << 8);   // high half
    } else {
        w[word] = (w[word] & 0xFF00U) | (value & 0xFFU);          // low half
    }
}

static inline uint16_t floatGetWireByte(float32_t f, uint16_t index)
{
    const uint16_t *w = (const uint16_t *)&f;
    uint16_t word = 1U - (index >> 1);
    return ((index & 1U) == 0U) ? ((w[word] >> 8) & 0xFFU) : (w[word] & 0xFFU);
}

#pragma CODE_SECTION(i2cSlaveISR, "isrcodefuncs")
#pragma INTERRUPT(i2cSlaveISR, HPI)
//
// Host register bus, target side.
//
// The transaction shapes the ESP32 uses are:
//
//   write:  S 0x50 W  addrHi addrLo  d0 d1 d2 d3 ...  P
//   read:   S 0x50 W  addrHi addrLo  Sr 0x50 R  d0 d1 d2 d3 ...  P
//
// So a read is addressed twice and the register address has to survive the
// repeated start in between. That single requirement is what most of the
// state handling below is protecting.
//
// Framing lives on PIE 8.1 (address match, stop, errors) and the data bytes
// on 8.2 (the FIFOs). Keeping them apart is not cosmetic: with the FIFO
// enabled the TRM forbids the basic RRDY/XRDY interrupts, and mixing the two
// is what previously let a data byte be parsed as an address byte.
//
static void i2cTargetResetCommand(void)
{
    rxPhase     = eI2cAddrHi;
    txCount     = 0U;
    bufferValid = 0;
    tempData    = 0.0f;
}

#pragma CODE_SECTION(i2cSlaveISR, "isrcodefuncs")
#pragma INTERRUPT(i2cSlaveISR, HPI)
__interrupt void i2cSlaveISR(void)
{
    uint32_t intSource = I2C_getInterruptStatus(I2CA_BASE);

    dbgSlaveIsr++;

    //
    // Reading I2CISRC advances the module's interrupt queue. Without it the
    // current source stays pending, this handler is never re-entered, and the
    // module ends up holding SCL low waiting for software that never comes.
    //
    (void)HWREGH(I2CA_BASE + I2C_O_ISRC);

    //
    // Errors first. A host that abandons a transfer - which it does on every
    // timeout - latches one of these, and left unhandled the target stops
    // servicing the bus entirely.
    //
    if (intSource & (I2C_INT_ARB_LOST | I2C_INT_NO_ACK)) {
        dbgSlaveErr++;
        I2C_clearStatus(I2CA_BASE, I2C_STS_ARB_LOST | I2C_STS_NO_ACK);
        i2cTargetResetCommand();
        currentRegAddr = 0;
    }

    //
    // Address match.
    //
    // AAS is a level, not a latched flag: it stays asserted for as long as
    // this unit is the addressed target, so it has to be edge-detected or
    // every later interrupt in the same transaction looks like a fresh
    // command and resets the parser mid-address.
    //
    {
        uint16_t aasNow = ((intSource & I2C_INT_ADDR_TARGET) != 0U) ? 1U : 0U;
        uint16_t dirNow = ((I2C_getStatus(I2CA_BASE) & I2C_STS_TARGET_DIR) != 0U)
                        ? 1U : 0U;

        //
        // A new phase is either AAS going high, or the direction
        // flipping while it stays high.
        //
        // A register read is addressed twice - write the address, then a
        // repeated start to read - and AAS does not necessarily drop in
        // between. Keying purely off its edge meant the read half was
        // never recognised, so the transmit side was never primed and the
        // host received everything one byte late.
        //
        if (((aasNow != 0U) && (aasPrev == 0U)) ||
            ((aasNow != 0U) && (dirNow != dirPrev))) {
            dbgSlaveAddr++;

            //
            // Only a write starts a new command. The second address match of
            // a register read must leave currentRegAddr alone - that address
            // is the whole point of the write phase that preceded it.
            //
            if ((I2C_getStatus(I2CA_BASE) & I2C_STS_TARGET_DIR) == 0U) {
                isWrite = 1U;
                i2cTargetResetCommand();
            } else {
                //
                // Read phase. The data was staged when the address was
                // received, so there is nothing to do here but note the
                // direction - touching the FIFO now would discard the
                // byte already waiting to go out.
                //
                isWrite = 0U;
            }
            }
        aasPrev = aasNow;
        dirPrev = dirNow;
    }

    //
    // Stop ends the transaction. Handled after the address match so a stop
    // left over from the previous command cannot wipe the address this one
    // has just supplied.
    //
    if (intSource & I2C_INT_STOP_CONDITION) {
        i2cTargetResetCommand();
        aasPrev = 0U;
    }

    I2C_clearInterruptStatus(I2CA_BASE, intSource);
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP8);
}

//
// FIFO half of the target: the actual data bytes.
//
#pragma CODE_SECTION(i2cSlaveFifoISR, "isrcodefuncs")
#pragma INTERRUPT(i2cSlaveFifoISR, HPI)
__interrupt void i2cSlaveFifoISR(void)
{
    uint32_t intSource = I2C_getInterruptStatus(I2CA_BASE);

    dbgSlaveIsr++;

    //
    // Receive: drain the whole FIFO. More than one byte can arrive between
    // interrupts, and anything left behind stalls the bus.
    //
    if (intSource & I2C_INT_RXFF) {
        while (I2C_getRxFIFOStatus(I2CA_BASE) != I2C_FIFO_RX0) {
            uint16_t rxData = I2C_getData(I2CA_BASE) & 0xFFU;

