ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
            dbgSlaveRx++;
            if (dbgRxIdx < 8U) {
                dbgRxSeq[dbgRxIdx++] = rxData;
            }

            switch (rxPhase) {
            case eI2cAddrHi:
                currentRegAddr = (uint16_t)(rxData << 8);
                rxPhase        = eI2cAddrLo;
                break;

            case eI2cAddrLo:
                currentRegAddr |= rxData;
                dbgLastReg      = currentRegAddr;
                rxDataIdx       = 0U;
                rxPhase         = eI2cData;

                //
                // Stage the register now, while the address phase is
                // still in progress.
                //
                // If this turns out to be a read, the module starts
                // clocking data out the moment it acknowledges the
                // repeated start - before any interrupt can be serviced.
                // Whatever I2CDXR holds at that instant is what the host
                // receives first, so it has to be the real first byte
                // already. Waiting until the read phase to load it is
                // what put a stale byte in front of every reply and left
                // the four real bytes one place late.
                //
                {
                    uint16_t  regIdx = currentRegAddr / 4U;
                    float32_t v      = (regIdx < TOTAL_REGISTERS)
                                     ? registers[regIdx] : -1.0f;
                    uint16_t  i;

                    for (i = 0; i < 4U; i++) {
                        readBuffer[i] = floatGetWireByte(v, i);
                    }
                    bufferValid = 1;
                    txCount     = 1U;
                    I2C_putData(I2CA_BASE, readBuffer[0]);
                }
                break;

            case eI2cData:
            default:
                floatPutWireByte(&tempData, rxDataIdx, rxData);
                rxDataIdx++;

                if (rxDataIdx >= 4U) {
                    uint16_t regIdx = currentRegAddr / 4U;

                    if ((regIdx < TOTAL_REGISTERS) &&
                        (regConfig[regIdx].access == REG_ACCESS_RW)) {
                        applyHostRegisterWrite(regIdx, tempData);
                    }

                    tempData  = 0.0f;
                    rxDataIdx = 0U;

                    //
                    // Auto-increment for a multi-register write, bounded at
                    // the end of the map. Unbounded it walks off the end and
                    // stays there, and since the address persists across
                    // transactions every later read returns out of range.
                    //
                    if (((currentRegAddr + 4U) / 4U) < TOTAL_REGISTERS) {
                        currentRegAddr += 4U;
                    }
                }
                break;
            }
        }

        I2C_clearInterruptStatus(I2CA_BASE, I2C_INT_RXFF);
    }

    //
    // Transmit: the host is reading, so serve the register currentRegAddr
    // points at, one wire byte at a time.
    //
    if (intSource & I2C_INT_TXFF) {
        if ((I2C_getStatus(I2CA_BASE) & I2C_STS_TARGET_DIR) != 0U) {
            dbgSlaveTx++;

            //
            // Load the register only at the start of a four-byte group.
            //
            // bufferValid is cleared as each register finishes so the
            // next one is fetched, but testing it here as well meant a
            // reload could happen part way through a group - after the
            // address had already auto-incremented - so the four bytes
            // the host received were spliced from two different
            // registers. txCount alone marks the group boundary.
            //
            if (txCount == 0U) {
                uint16_t  regIdx   = currentRegAddr / 4U;
                float32_t regValue = (regIdx < TOTAL_REGISTERS)
                                   ? registers[regIdx] : -1.0f;
                uint16_t  i;

                dbgLastReg = currentRegAddr;

                for (i = 0; i < 4U; i++) {
                    readBuffer[i] = floatGetWireByte(regValue, i);
                }
                bufferValid = 1;
                txCount     = 0U;
            }

            I2C_putData(I2CA_BASE, readBuffer[txCount]);
            txCount++;

            if (txCount >= 4U) {
                //
                // Register delivered. Auto-increment so a host can burst
                // consecutive registers without re-sending an address, and
                // force a reload on the next byte.
                //
                txCount     = 0U;
                bufferValid = 0;

                if (((currentRegAddr + 4U) / 4U) < TOTAL_REGISTERS) {
                    currentRegAddr += 4U;
                }
            }
        }

        I2C_clearInterruptStatus(I2CA_BASE, I2C_INT_TXFF);
    }

    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP8);
}

#pragma CODE_SECTION(canISR, "isrcodefuncs")
#pragma INTERRUPT(canISR, HPI)
__interrupt void canISR(void)
{
    //
    // The INT0ID field of the CAN interrupt register holds the message
    // object number that raised the interrupt, or CAN_INT_INT0ID_STATUS for
    // an error/status event. Object 9 is the host register read/write mailbox.
    //
    uint32_t intCause = CAN_getInterruptCause(CANA_BASE) & 0xFFFFU;

    if (intCause == CAN_INT_INT0ID_STATUS) {
        // Reading the status register clears the condition.
        (void)CAN_getStatus(CANA_BASE);
    } else if (intCause == 9U) {
        uint16_t data[8];
        CAN_MsgFrameType frameType;
        uint32_t rxMsgId = 0;

        if (CAN_readMessageWithID(CANA_BASE, 9, &frameType, &rxMsgId, data)) {
            uint16_t regAddr = ((data[0] & 0xFFU) << 8) | (data[1] & 0xFFU);
            uint16_t regIdx = regAddr / 4;

            if (data[2] == 0x01 && regIdx < TOTAL_REGISTERS &&
                regConfig[regIdx].access == REG_ACCESS_RW) {
                float32_t value;
                uint16_t *w = (uint16_t *)&value;
                w[0] = (data[4] & 0xFFU) | ((data[5] & 0xFFU) << 8);
                w[1] = (data[6] & 0xFFU) | ((data[7] & 0xFFU) << 8);
                applyHostRegisterWrite(regIdx, value);
            } else if (data[2] == 0x00 && regIdx < TOTAL_REGISTERS) {
                float32_t value = registers[regIdx];
                const uint16_t *w = (const uint16_t *)&value;
                uint16_t reply[8];
                reply[0] = data[0];
                reply[1] = data[1];
                reply[2] = 0x00;
                reply[3] = 0x00;
                reply[4] = w[0] & 0xFFU;
                reply[5] = (w[0] >> 8) & 0xFFU;
                reply[6] = w[1] & 0xFFU;
                reply[7] = (w[1] >> 8) & 0xFFU;
                CAN_sendMessage(CANA_BASE, 9, 8, reply);
            }
        }
        CAN_clearInterruptStatus(CANA_BASE, 9);
    }

    CAN_clearGlobalInterruptStatus(CANA_BASE, CAN_GLOBAL_INT_CANINT0);
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP9);
}

void SFRA_startCalibration(void)
{
    uartSendResponse("SFRA Calibration Started");
}

#if (BTS_CONSOLE_ENABLED == true)
#define UART_BUFFER_SIZE 64
static char uartBuffer[UART_BUFFER_SIZE];
static uint16_t uartBufIdx = 0;
#endif

