ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/com_cpu2.c
void uartSendResponse(const char* response)
{
#if (BTS_CONSOLE_ENABLED == true)
    while (*response) {
        SCI_writeCharBlockingFIFO(BTS_CONSOLE_SCI_BASE, (uint16_t)(*response++) & 0xFFU);
    }
    SCI_writeCharBlockingFIFO(BTS_CONSOLE_SCI_BASE, '\r');
    SCI_writeCharBlockingFIFO(BTS_CONSOLE_SCI_BASE, '\n');
#else
    (void)response;
#endif
}

#if (BTS_CONSOLE_ENABLED == true)
//
// Formats "+<name>=<value>" with two decimal places.
//
// printf's %f promotes its argument to double, which this project forbids
// (--float_operations_allowed=32), so the fraction is rendered from a scaled
// 32-bit integer instead.
//
static void formatRegisterValue(char *out, uint16_t outSize,
                                const char *name, float32_t value)
{
    int32_t scaled;
    int32_t whole;
    int32_t frac;
    bool negative = false;

    if (value < 0.0f) {
        negative = true;
        value = -value;
    }

    // Round to two decimal places.
    scaled = (int32_t)(value * 100.0f + 0.5f);
    whole  = scaled / 100;
    frac   = scaled % 100;

    snprintf(out, outSize, "+%s=%s%ld.%02ld",
             name, negative ? "-" : "", (long)whole, (long)frac);
}
#endif

#pragma CODE_SECTION(uartRxISR, "isrcodefuncs")
#pragma INTERRUPT(uartRxISR, HPI)
__interrupt void uartRxISR(void)
{
#if (BTS_CONSOLE_ENABLED == true)
    uint32_t intSource = SCI_getInterruptStatus(BTS_CONSOLE_SCI_BASE);
    //
    // Drain everything the FIFO holds - more than one character can arrive
    // between interrupts.
    //
    while (SCI_getRxFIFOStatus(BTS_CONSOLE_SCI_BASE) != SCI_FIFO_RX0) {
        char rxChar = (char)(SCI_readCharNonBlocking(BTS_CONSOLE_SCI_BASE) & 0xFFU);
        if (rxChar == '\n' || rxChar == '\r') {
            uartBuffer[uartBufIdx] = '\0';
            if (strncmp(uartBuffer, "AT+", 3) == 0) {
                char* cmd = uartBuffer + 3;
                char* valueStr = strchr(cmd, '=');
                char* query = strchr(cmd, '?');
                uint16_t regIdx = TOTAL_REGISTERS;

                if (strncmp(cmd, "SFRA_CAL", 8) == 0 && sfraEnabled) {
                    if (!valueStr && !query) {
                        SFRA_startCalibration();
                        uartSendResponse("OK");
                    } else {
                        uartSendResponse("ERROR: Invalid SFRA command");
                    }
                    uartBufIdx = 0;
                    SCI_clearInterruptStatus(BTS_CONSOLE_SCI_BASE, intSource);
                    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP9);
                    return;
                }

                char regName[32];
                if (valueStr) *valueStr = '\0';
                if (query) *query = '\0';
                strncpy(regName, cmd, sizeof(regName) - 1);
                regName[sizeof(regName) - 1] = '\0';

                for (uint16_t i = 0; i < TOTAL_REGISTERS; i++) {
                    if (strcmp(regName, uartRegConfig[i].shortName) == 0 ||
                        strcmp(regName, uartRegConfig[i].longName) == 0) {
                        regIdx = i;
                        break;
                    }
                }

                if (regIdx == TOTAL_REGISTERS) {
                    uartSendResponse("ERROR: Invalid register");
                } else if (valueStr) {
                    if (uartRegConfig[regIdx].access == REG_ACCESS_RO) {
                        uartSendResponse("ERROR: Read-only register");
                    } else {
                        // strtof, not atof: the project builds with
                        // --float_operations_allowed=32, which rules out the
                        // double-returning atof.
                        float value = strtof(valueStr + 1, 0);
                        applyHostRegisterWrite(regIdx, value);
                        uartSendResponse("OK");
                    }
                } else if (query) {
                    char response[40];
                    formatRegisterValue(response, sizeof(response), regName, registers[regIdx]);
                    uartSendResponse(response);
                    uartSendResponse("OK");
                } else {
                    uartSendResponse("ERROR: Invalid command");
                }
            }
            uartBufIdx = 0;
        } else if (uartBufIdx < UART_BUFFER_SIZE - 1) {
            uartBuffer[uartBufIdx++] = rxChar;
        }
    }
    SCI_clearInterruptStatus(BTS_CONSOLE_SCI_BASE, intSource);
#endif
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP9);
}

/*
 * CPU 2 Main Routine
 *
 * Boot order matters: the peripherals that reach the EEPROM come up first,
 * then loadCalibration() populates the register file from EEPROM (or from
 * defaults) and notifies CPU1 to recalculate and run. Interrupts are only
 * enabled once that initial register file is in place, so a host write can
 * never race the boot-time load.
 */
void main(void)
{
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();

    initI2C_Master();

    //
    // Establish the register file before anything can observe or modify it.
    //
    loadCalibration();

    initI2C_Slave();
    initUART();
    initCAN();
    initTimer();
    LEDDriver_init();

    EINT;
    ERTM;

    //
    // Boot banner - confirms init completed and the console is alive.
    // Printed before any interrupt-driven work so it still appears if a
    // peripheral on the I2C bus is absent or misbehaving.
    //
#if (BTS_CONSOLE_ENABLED == true)
    uartSendResponse("");
    uartSendResponse("BTS F2837xD CPU2 ready");
    {
        char line[48];
        formatRegisterValue(line, sizeof(line), "ChargeDisableV",
                            registers[BTS_REG_IDX(eChargeDisableV)]);
        uartSendResponse(line);
        formatRegisterValue(line, sizeof(line), "Ch0_F28V_Gain",
                            registers[BTS_CAL_BASE(0) + BTS_CAL_F28V_GAIN]);
        uartSendResponse(line);
    }
    uartSendResponse("OK");
#endif

    //
    // Temperature acquisition last: its DRDY ISRs drive the I2CB bus, so the
    // console and the register interfaces are already up before they start.
    // If a converter is absent the bounded I2C helpers simply time out.
    //
    initADS1119();

    while (1) {
        //
        // Background work. Both perform at most one short, non-blocking
        // step per pass, so the console, the I2CA slave and CAN stay
        // responsive while I2CB is driven continuously.
        //
        BTS_serviceADS1119();
        BTS_serviceDeferredWork();
    }
}

#endif
